 verX:  [-385, -375, -365, -355, -345, -335, -325, -315, -305, -295, -285, -275, -265, -255, -245, -235, -225, -215, -205, -195, -185, -175, -165, -155, -145, -135, -125, -115, -105, -95, -85, -75, -65, -55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455]

 verY:  [-55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455, 465, 475, 485, 495, 505, 515, 525, 535, 545, 555, 565, 575, 585, 595, 605, 615, 625, 635]

 verZ:  [-185, -175, -165, -155, -145, -135, -125, -115, -105, -95, -85, -75, -65, -55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455, 465, 475, 485, 495, 505, 515, 525, 535, 545, 555, 565, 575, 585, 595, 605, 615, 625, 635, 645, 655]
Step size along X:  85
Step size along Y:  70
Step size along Z:  85

Total Num of vertex:  505750
Loading protodunehd_v6 160 opch net...
Model: "protodunehd_model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 pos_y (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 pos_z (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 dense_2 (Dense)                (None, 10)           20          ['pos_y[0][0]']                  
                                                                                                  
 dense_3 (Dense)                (None, 8)            16          ['pos_z[0][0]']                  
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 10)          40          ['dense_2[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 8)           32          ['dense_3[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 pos_x (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 re_lu_2 (ReLU)                 (None, 10)           0           ['batch_normalization_2[0][0]']  
                                                                                                  
 re_lu_3 (ReLU)                 (None, 8)            0           ['batch_normalization_3[0][0]']  
                                                                                                  
 dense (Dense)                  (None, 1)            2           ['pos_x[0][0]']                  
                                                                                                  
 dense_1 (Dense)                (None, 1)            2           ['pos_x[0][0]']                  
                                                                                                  
 lambda (Lambda)                (None, 10, 8)        0           ['re_lu_2[0][0]',                
                                                                  're_lu_3[0][0]']                
                                                                                                  
 batch_normalization (BatchNorm  (None, 1)           4           ['dense[0][0]']                  
 alization)                                                                                       
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 1)           4           ['dense_1[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 flatten (Flatten)              (None, 80)           0           ['lambda[0][0]']                 
                                                                                                  
 re_lu (ReLU)                   (None, 1)            0           ['batch_normalization[0][0]']    
                                                                                                  
 re_lu_1 (ReLU)                 (None, 1)            0           ['batch_normalization_1[0][0]']  
                                                                                                  
 multiply (Multiply)            (None, 80)           0           ['flatten[0][0]',                
                                                                  're_lu[0][0]']                  
                                                                                                  
 multiply_1 (Multiply)          (None, 80)           0           ['flatten[0][0]',                
                                                                  're_lu_1[0][0]']                
                                                                                                  
 dense_4 (Dense)                (None, 640)          51840       ['multiply[0][0]']               
                                                                                                  
 dense_5 (Dense)                (None, 640)          51840       ['multiply_1[0][0]']             
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 640)         2560        ['dense_4[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 640)         2560        ['dense_5[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 re_lu_4 (ReLU)                 (None, 640)          0           ['batch_normalization_4[0][0]']  
                                                                                                  
 re_lu_5 (ReLU)                 (None, 640)          0           ['batch_normalization_5[0][0]']  
                                                                                                  
 concatenate (Concatenate)      (None, 1280)         0           ['re_lu_4[0][0]',                
                                                                  're_lu_5[0][0]']                
                                                                                                  
 dense_6 (Dense)                (None, 160)          204960      ['concatenate[0][0]']            
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 160)         640         ['dense_6[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 re_lu_6 (ReLU)                 (None, 160)          0           ['batch_normalization_6[0][0]']  
                                                                                                  
 vis_full (Dense)               (None, 160)          25760       ['re_lu_6[0][0]']                
                                                                                                  
==================================================================================================
Total params: 340,280
Trainable params: 337,360
Non-trainable params: 2,920
__________________________________________________________________________________________________
Loading weights...
Predicting...
    1/15805 [..............................] - ETA: 30:27  104/15805 [..............................] - ETA: 7s     214/15805 [..............................] - ETA: 7s  325/15805 [..............................] - ETA: 7s  434/15805 [..............................] - ETA: 7s  544/15805 [>.............................] - ETA: 7s  654/15805 [>.............................] - ETA: 6s  763/15805 [>.............................] - ETA: 6s  873/15805 [>.............................] - ETA: 6s  983/15805 [>.............................] - ETA: 6s 1093/15805 [=>............................] - ETA: 6s 1202/15805 [=>............................] - ETA: 6s 1312/15805 [=>............................] - ETA: 6s 1423/15805 [=>............................] - ETA: 6s 1533/15805 [=>............................] - ETA: 6s 1643/15805 [==>...........................] - ETA: 6s 1751/15805 [==>...........................] - ETA: 6s 1860/15805 [==>...........................] - ETA: 6s 1970/15805 [==>...........................] - ETA: 6s 2080/15805 [==>...........................] - ETA: 6s 2190/15805 [===>..........................] - ETA: 6s 2300/15805 [===>..........................] - ETA: 6s 2410/15805 [===>..........................] - ETA: 6s 2521/15805 [===>..........................] - ETA: 6s 2631/15805 [===>..........................] - ETA: 6s 2741/15805 [====>.........................] - ETA: 5s 2851/15805 [====>.........................] - ETA: 5s 2961/15805 [====>.........................] - ETA: 5s 3071/15805 [====>.........................] - ETA: 5s 3181/15805 [=====>........................] - ETA: 5s 3291/15805 [=====>........................] - ETA: 5s 3401/15805 [=====>........................] - ETA: 5s 3511/15805 [=====>........................] - ETA: 5s 3621/15805 [=====>........................] - ETA: 5s 3731/15805 [======>.......................] - ETA: 5s 3842/15805 [======>.......................] - ETA: 5s 3948/15805 [======>.......................] - ETA: 5s 4057/15805 [======>.......................] - ETA: 5s 4166/15805 [======>.......................] - ETA: 5s 4275/15805 [=======>......................] - ETA: 5s 4385/15805 [=======>......................] - ETA: 5s 4495/15805 [=======>......................] - ETA: 5s 4604/15805 [=======>......................] - ETA: 5s 4714/15805 [=======>......................] - ETA: 5s 4824/15805 [========>.....................] - ETA: 5s 4934/15805 [========>.....................] - ETA: 4s 5038/15805 [========>.....................] - ETA: 4s 5148/15805 [========>.....................] - ETA: 4s 5258/15805 [========>.....................] - ETA: 4s 5367/15805 [=========>....................] - ETA: 4s 5477/15805 [=========>....................] - ETA: 4s 5587/15805 [=========>....................] - ETA: 4s 5697/15805 [=========>....................] - ETA: 4s 5808/15805 [==========>...................] - ETA: 4s 5918/15805 [==========>...................] - ETA: 4s 6028/15805 [==========>...................] - ETA: 4s 6133/15805 [==========>...................] - ETA: 4s 6242/15805 [==========>...................] - ETA: 4s 6353/15805 [===========>..................] - ETA: 4s 6459/15805 [===========>..................] - ETA: 4s 6567/15805 [===========>..................] - ETA: 4s 6676/15805 [===========>..................] - ETA: 4s 6785/15805 [===========>..................] - ETA: 4s 6895/15805 [============>.................] - ETA: 4s 7005/15805 [============>.................] - ETA: 4s 7114/15805 [============>.................] - ETA: 3s 7218/15805 [============>.................] - ETA: 3s 7327/15805 [============>.................] - ETA: 3s 7421/15805 [=============>................] - ETA: 3s 7526/15805 [=============>................] - ETA: 3s 7635/15805 [=============>................] - ETA: 3s 7744/15805 [=============>................] - ETA: 3s 7854/15805 [=============>................] - ETA: 3s 7964/15805 [==============>...............] - ETA: 3s 8073/15805 [==============>...............] - ETA: 3s 8180/15805 [==============>...............] - ETA: 3s 8289/15805 [==============>...............] - ETA: 3s 8397/15805 [==============>...............] - ETA: 3s 8506/15805 [===============>..............] - ETA: 3s 8615/15805 [===============>..............] - ETA: 3s 8725/15805 [===============>..............] - ETA: 3s 8834/15805 [===============>..............] - ETA: 3s 8944/15805 [===============>..............] - ETA: 3s 9053/15805 [================>.............] - ETA: 3s 9163/15805 [================>.............] - ETA: 3s 9269/15805 [================>.............] - ETA: 3s 9377/15805 [================>.............] - ETA: 2s 9487/15805 [=================>............] - ETA: 2s 9596/15805 [=================>............] - ETA: 2s 9705/15805 [=================>............] - ETA: 2s 9815/15805 [=================>............] - ETA: 2s 9925/15805 [=================>............] - ETA: 2s10035/15805 [==================>...........] - ETA: 2s10144/15805 [==================>...........] - ETA: 2s10254/15805 [==================>...........] - ETA: 2s10362/15805 [==================>...........] - ETA: 2s10471/15805 [==================>...........] - ETA: 2s10580/15805 [===================>..........] - ETA: 2s10689/15805 [===================>..........] - ETA: 2s10799/15805 [===================>..........] - ETA: 2s10909/15805 [===================>..........] - ETA: 2s11019/15805 [===================>..........] - ETA: 2s11130/15805 [====================>.........] - ETA: 2s11239/15805 [====================>.........] - ETA: 2s11348/15805 [====================>.........] - ETA: 2s11457/15805 [====================>.........] - ETA: 2s11566/15805 [====================>.........] - ETA: 1s11676/15805 [=====================>........] - ETA: 1s11785/15805 [=====================>........] - ETA: 1s11894/15805 [=====================>........] - ETA: 1s12004/15805 [=====================>........] - ETA: 1s12113/15805 [=====================>........] - ETA: 1s12223/15805 [======================>.......] - ETA: 1s12332/15805 [======================>.......] - ETA: 1s12442/15805 [======================>.......] - ETA: 1s12546/15805 [======================>.......] - ETA: 1s12655/15805 [=======================>......] - ETA: 1s12764/15805 [=======================>......] - ETA: 1s12873/15805 [=======================>......] - ETA: 1s12983/15805 [=======================>......] - ETA: 1s13092/15805 [=======================>......] - ETA: 1s13202/15805 [========================>.....] - ETA: 1s13311/15805 [========================>.....] - ETA: 1s13420/15805 [========================>.....] - ETA: 1s13530/15805 [========================>.....] - ETA: 1s13639/15805 [========================>.....] - ETA: 1s13748/15805 [=========================>....] - ETA: 0s13858/15805 [=========================>....] - ETA: 0s13969/15805 [=========================>....] - ETA: 0s14079/15805 [=========================>....] - ETA: 0s14190/15805 [=========================>....] - ETA: 0s14301/15805 [==========================>...] - ETA: 0s14412/15805 [==========================>...] - ETA: 0s14522/15805 [==========================>...] - ETA: 0s14632/15805 [==========================>...] - ETA: 0s14740/15805 [==========================>...] - ETA: 0s14849/15805 [===========================>..] - ETA: 0s14958/15805 [===========================>..] - ETA: 0s15067/15805 [===========================>..] - ETA: 0s15177/15805 [===========================>..] - ETA: 0s15286/15805 [============================>.] - ETA: 0s15396/15805 [============================>.] - ETA: 0s15506/15805 [============================>.] - ETA: 0s15615/15805 [============================>.] - ETA: 0s15724/15805 [============================>.] - ETA: 0s15805/15805 [==============================] - 7s 463us/step



Finish evaluation in 9.298020839691162s.

size of value_emul:  505750
Length of pos_X   :  505750
Num of vertex     :  505750
---------------------------------
