 verX:  [-385, -375, -365, -355, -345, -335, -325, -315, -305, -295, -285, -275, -265, -255, -245, -235, -225, -215, -205, -195, -185, -175, -165, -155, -145, -135, -125, -115, -105, -95, -85, -75, -65, -55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455]

 verY:  [-55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455, 465, 475, 485, 495, 505, 515, 525, 535, 545, 555, 565, 575, 585, 595, 605, 615, 625, 635]

 verZ:  [-185, -175, -165, -155, -145, -135, -125, -115, -105, -95, -85, -75, -65, -55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455, 465, 475, 485, 495, 505, 515, 525, 535, 545, 555, 565, 575, 585, 595, 605, 615, 625, 635, 645, 655]
Step size along X:  85
Step size along Y:  70
Step size along Z:  85

Total Num of vertex:  505750
Loading protodunehd_v6 160 opch net...
Model: "protodunehd_model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 pos_y (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 pos_z (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 dense_2 (Dense)                (None, 10)           20          ['pos_y[0][0]']                  
                                                                                                  
 dense_3 (Dense)                (None, 8)            16          ['pos_z[0][0]']                  
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 10)          40          ['dense_2[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 8)           32          ['dense_3[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 pos_x (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 re_lu_2 (ReLU)                 (None, 10)           0           ['batch_normalization_2[0][0]']  
                                                                                                  
 re_lu_3 (ReLU)                 (None, 8)            0           ['batch_normalization_3[0][0]']  
                                                                                                  
 dense (Dense)                  (None, 1)            2           ['pos_x[0][0]']                  
                                                                                                  
 dense_1 (Dense)                (None, 1)            2           ['pos_x[0][0]']                  
                                                                                                  
 lambda (Lambda)                (None, 10, 8)        0           ['re_lu_2[0][0]',                
                                                                  're_lu_3[0][0]']                
                                                                                                  
 batch_normalization (BatchNorm  (None, 1)           4           ['dense[0][0]']                  
 alization)                                                                                       
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 1)           4           ['dense_1[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 flatten (Flatten)              (None, 80)           0           ['lambda[0][0]']                 
                                                                                                  
 re_lu (ReLU)                   (None, 1)            0           ['batch_normalization[0][0]']    
                                                                                                  
 re_lu_1 (ReLU)                 (None, 1)            0           ['batch_normalization_1[0][0]']  
                                                                                                  
 multiply (Multiply)            (None, 80)           0           ['flatten[0][0]',                
                                                                  're_lu[0][0]']                  
                                                                                                  
 multiply_1 (Multiply)          (None, 80)           0           ['flatten[0][0]',                
                                                                  're_lu_1[0][0]']                
                                                                                                  
 dense_4 (Dense)                (None, 640)          51840       ['multiply[0][0]']               
                                                                                                  
 dense_5 (Dense)                (None, 640)          51840       ['multiply_1[0][0]']             
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 640)         2560        ['dense_4[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 640)         2560        ['dense_5[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 re_lu_4 (ReLU)                 (None, 640)          0           ['batch_normalization_4[0][0]']  
                                                                                                  
 re_lu_5 (ReLU)                 (None, 640)          0           ['batch_normalization_5[0][0]']  
                                                                                                  
 concatenate (Concatenate)      (None, 1280)         0           ['re_lu_4[0][0]',                
                                                                  're_lu_5[0][0]']                
                                                                                                  
 dense_6 (Dense)                (None, 160)          204960      ['concatenate[0][0]']            
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 160)         640         ['dense_6[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 re_lu_6 (ReLU)                 (None, 160)          0           ['batch_normalization_6[0][0]']  
                                                                                                  
 vis_full (Dense)               (None, 160)          25760       ['re_lu_6[0][0]']                
                                                                                                  
==================================================================================================
Total params: 340,280
Trainable params: 337,360
Non-trainable params: 2,920
__________________________________________________________________________________________________
Loading weights...
Predicting...
    1/15805 [..............................] - ETA: 28:32   84/15805 [..............................] - ETA: 9s     196/15805 [..............................] - ETA: 8s  307/15805 [..............................] - ETA: 7s  418/15805 [..............................] - ETA: 7s  529/15805 [>.............................] - ETA: 7s  641/15805 [>.............................] - ETA: 7s  753/15805 [>.............................] - ETA: 7s  865/15805 [>.............................] - ETA: 6s  976/15805 [>.............................] - ETA: 6s 1088/15805 [=>............................] - ETA: 6s 1199/15805 [=>............................] - ETA: 6s 1309/15805 [=>............................] - ETA: 6s 1420/15805 [=>............................] - ETA: 6s 1531/15805 [=>............................] - ETA: 6s 1643/15805 [==>...........................] - ETA: 6s 1754/15805 [==>...........................] - ETA: 6s 1865/15805 [==>...........................] - ETA: 6s 1977/15805 [==>...........................] - ETA: 6s 2087/15805 [==>...........................] - ETA: 6s 2197/15805 [===>..........................] - ETA: 6s 2285/15805 [===>..........................] - ETA: 6s 2396/15805 [===>..........................] - ETA: 6s 2507/15805 [===>..........................] - ETA: 6s 2618/15805 [===>..........................] - ETA: 6s 2730/15805 [====>.........................] - ETA: 6s 2842/15805 [====>.........................] - ETA: 5s 2953/15805 [====>.........................] - ETA: 5s 3065/15805 [====>.........................] - ETA: 5s 3176/15805 [=====>........................] - ETA: 5s 3288/15805 [=====>........................] - ETA: 5s 3401/15805 [=====>........................] - ETA: 5s 3511/15805 [=====>........................] - ETA: 5s 3622/15805 [=====>........................] - ETA: 5s 3734/15805 [======>.......................] - ETA: 5s 3845/15805 [======>.......................] - ETA: 5s 3952/15805 [======>.......................] - ETA: 5s 4063/15805 [======>.......................] - ETA: 5s 4175/15805 [======>.......................] - ETA: 5s 4285/15805 [=======>......................] - ETA: 5s 4397/15805 [=======>......................] - ETA: 5s 4508/15805 [=======>......................] - ETA: 5s 4620/15805 [=======>......................] - ETA: 5s 4732/15805 [=======>......................] - ETA: 5s 4843/15805 [========>.....................] - ETA: 5s 4954/15805 [========>.....................] - ETA: 4s 5066/15805 [========>.....................] - ETA: 4s 5178/15805 [========>.....................] - ETA: 4s 5290/15805 [=========>....................] - ETA: 4s 5401/15805 [=========>....................] - ETA: 4s 5512/15805 [=========>....................] - ETA: 4s 5622/15805 [=========>....................] - ETA: 4s 5733/15805 [=========>....................] - ETA: 4s 5845/15805 [==========>...................] - ETA: 4s 5953/15805 [==========>...................] - ETA: 4s 6065/15805 [==========>...................] - ETA: 4s 6177/15805 [==========>...................] - ETA: 4s 6286/15805 [==========>...................] - ETA: 4s 6397/15805 [===========>..................] - ETA: 4s 6506/15805 [===========>..................] - ETA: 4s 6617/15805 [===========>..................] - ETA: 4s 6728/15805 [===========>..................] - ETA: 4s 6838/15805 [===========>..................] - ETA: 4s 6948/15805 [============>.................] - ETA: 4s 7059/15805 [============>.................] - ETA: 3s 7170/15805 [============>.................] - ETA: 3s 7281/15805 [============>.................] - ETA: 3s 7394/15805 [=============>................] - ETA: 3s 7421/15805 [=============>................] - ETA: 3s 7529/15805 [=============>................] - ETA: 3s 7641/15805 [=============>................] - ETA: 3s 7753/15805 [=============>................] - ETA: 3s 7864/15805 [=============>................] - ETA: 3s 7976/15805 [==============>...............] - ETA: 3s 8088/15805 [==============>...............] - ETA: 3s 8199/15805 [==============>...............] - ETA: 3s 8310/15805 [==============>...............] - ETA: 3s 8421/15805 [==============>...............] - ETA: 3s 8532/15805 [===============>..............] - ETA: 3s 8643/15805 [===============>..............] - ETA: 3s 8754/15805 [===============>..............] - ETA: 3s 8865/15805 [===============>..............] - ETA: 3s 8978/15805 [================>.............] - ETA: 3s 9090/15805 [================>.............] - ETA: 3s 9202/15805 [================>.............] - ETA: 3s 9314/15805 [================>.............] - ETA: 2s 9426/15805 [================>.............] - ETA: 2s 9537/15805 [=================>............] - ETA: 2s 9649/15805 [=================>............] - ETA: 2s 9762/15805 [=================>............] - ETA: 2s 9874/15805 [=================>............] - ETA: 2s 9986/15805 [=================>............] - ETA: 2s10097/15805 [==================>...........] - ETA: 2s10208/15805 [==================>...........] - ETA: 2s10319/15805 [==================>...........] - ETA: 2s10431/15805 [==================>...........] - ETA: 2s10544/15805 [===================>..........] - ETA: 2s10655/15805 [===================>..........] - ETA: 2s10765/15805 [===================>..........] - ETA: 2s10876/15805 [===================>..........] - ETA: 2s10987/15805 [===================>..........] - ETA: 2s11098/15805 [====================>.........] - ETA: 2s11210/15805 [====================>.........] - ETA: 2s11321/15805 [====================>.........] - ETA: 2s11432/15805 [====================>.........] - ETA: 2s11544/15805 [====================>.........] - ETA: 1s11656/15805 [=====================>........] - ETA: 1s11767/15805 [=====================>........] - ETA: 1s11879/15805 [=====================>........] - ETA: 1s11991/15805 [=====================>........] - ETA: 1s12103/15805 [=====================>........] - ETA: 1s12214/15805 [======================>.......] - ETA: 1s12327/15805 [======================>.......] - ETA: 1s12439/15805 [======================>.......] - ETA: 1s12550/15805 [======================>.......] - ETA: 1s12662/15805 [=======================>......] - ETA: 1s12773/15805 [=======================>......] - ETA: 1s12885/15805 [=======================>......] - ETA: 1s12997/15805 [=======================>......] - ETA: 1s13107/15805 [=======================>......] - ETA: 1s13218/15805 [========================>.....] - ETA: 1s13328/15805 [========================>.....] - ETA: 1s13438/15805 [========================>.....] - ETA: 1s13550/15805 [========================>.....] - ETA: 1s13661/15805 [========================>.....] - ETA: 0s13773/15805 [=========================>....] - ETA: 0s13885/15805 [=========================>....] - ETA: 0s13986/15805 [=========================>....] - ETA: 0s14097/15805 [=========================>....] - ETA: 0s14208/15805 [=========================>....] - ETA: 0s14321/15805 [==========================>...] - ETA: 0s14428/15805 [==========================>...] - ETA: 0s14539/15805 [==========================>...] - ETA: 0s14651/15805 [==========================>...] - ETA: 0s14762/15805 [===========================>..] - ETA: 0s14874/15805 [===========================>..] - ETA: 0s14986/15805 [===========================>..] - ETA: 0s15099/15805 [===========================>..] - ETA: 0s15210/15805 [===========================>..] - ETA: 0s15321/15805 [============================>.] - ETA: 0s15433/15805 [============================>.] - ETA: 0s15545/15805 [============================>.] - ETA: 0s15656/15805 [============================>.] - ETA: 0s15768/15805 [============================>.] - ETA: 0s15805/15805 [==============================] - 7s 456us/step



Finish evaluation in 9.17480206489563s.

size of value_emul:  505750
Length of pos_X   :  505750
Num of vertex     :  505750
---------------------------------
