 verX:  [-385, -375, -365, -355, -345, -335, -325, -315, -305, -295, -285, -275, -265, -255, -245, -235, -225, -215, -205, -195, -185, -175, -165, -155, -145, -135, -125, -115, -105, -95, -85, -75, -65, -55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455]

 verY:  [-55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455, 465, 475, 485, 495, 505, 515, 525, 535, 545, 555, 565, 575, 585, 595, 605, 615, 625, 635]

 verZ:  [-185, -175, -165, -155, -145, -135, -125, -115, -105, -95, -85, -75, -65, -55, -45, -35, -25, -15, -5, 5, 15, 25, 35, 45, 55, 65, 75, 85, 95, 105, 115, 125, 135, 145, 155, 165, 175, 185, 195, 205, 215, 225, 235, 245, 255, 265, 275, 285, 295, 305, 315, 325, 335, 345, 355, 365, 375, 385, 395, 405, 415, 425, 435, 445, 455, 465, 475, 485, 495, 505, 515, 525, 535, 545, 555, 565, 575, 585, 595, 605, 615, 625, 635, 645, 655]
Step size along X:  85
Step size along Y:  70
Step size along Z:  85

Total Num of vertex:  505750
Loading protodunehd_v6 160 opch net...
Model: "protodunehd_model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 pos_y (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 pos_z (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 dense_2 (Dense)                (None, 10)           20          ['pos_y[0][0]']                  
                                                                                                  
 dense_3 (Dense)                (None, 8)            16          ['pos_z[0][0]']                  
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 10)          40          ['dense_2[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 8)           32          ['dense_3[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 pos_x (InputLayer)             [(None, 1)]          0           []                               
                                                                                                  
 re_lu_2 (ReLU)                 (None, 10)           0           ['batch_normalization_2[0][0]']  
                                                                                                  
 re_lu_3 (ReLU)                 (None, 8)            0           ['batch_normalization_3[0][0]']  
                                                                                                  
 dense (Dense)                  (None, 1)            2           ['pos_x[0][0]']                  
                                                                                                  
 dense_1 (Dense)                (None, 1)            2           ['pos_x[0][0]']                  
                                                                                                  
 lambda (Lambda)                (None, 10, 8)        0           ['re_lu_2[0][0]',                
                                                                  're_lu_3[0][0]']                
                                                                                                  
 batch_normalization (BatchNorm  (None, 1)           4           ['dense[0][0]']                  
 alization)                                                                                       
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 1)           4           ['dense_1[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 flatten (Flatten)              (None, 80)           0           ['lambda[0][0]']                 
                                                                                                  
 re_lu (ReLU)                   (None, 1)            0           ['batch_normalization[0][0]']    
                                                                                                  
 re_lu_1 (ReLU)                 (None, 1)            0           ['batch_normalization_1[0][0]']  
                                                                                                  
 multiply (Multiply)            (None, 80)           0           ['flatten[0][0]',                
                                                                  're_lu[0][0]']                  
                                                                                                  
 multiply_1 (Multiply)          (None, 80)           0           ['flatten[0][0]',                
                                                                  're_lu_1[0][0]']                
                                                                                                  
 dense_4 (Dense)                (None, 640)          51840       ['multiply[0][0]']               
                                                                                                  
 dense_5 (Dense)                (None, 640)          51840       ['multiply_1[0][0]']             
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 640)         2560        ['dense_4[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 640)         2560        ['dense_5[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 re_lu_4 (ReLU)                 (None, 640)          0           ['batch_normalization_4[0][0]']  
                                                                                                  
 re_lu_5 (ReLU)                 (None, 640)          0           ['batch_normalization_5[0][0]']  
                                                                                                  
 concatenate (Concatenate)      (None, 1280)         0           ['re_lu_4[0][0]',                
                                                                  're_lu_5[0][0]']                
                                                                                                  
 dense_6 (Dense)                (None, 160)          204960      ['concatenate[0][0]']            
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 160)         640         ['dense_6[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 re_lu_6 (ReLU)                 (None, 160)          0           ['batch_normalization_6[0][0]']  
                                                                                                  
 vis_full (Dense)               (None, 160)          25760       ['re_lu_6[0][0]']                
                                                                                                  
==================================================================================================
Total params: 340,280
Trainable params: 337,360
Non-trainable params: 2,920
__________________________________________________________________________________________________
Loading weights...
Predicting...
    1/15805 [..............................] - ETA: 27:27  106/15805 [..............................] - ETA: 7s     214/15805 [..............................] - ETA: 7s  323/15805 [..............................] - ETA: 7s  429/15805 [..............................] - ETA: 7s  537/15805 [>.............................] - ETA: 7s  642/15805 [>.............................] - ETA: 7s  750/15805 [>.............................] - ETA: 7s  857/15805 [>.............................] - ETA: 7s  965/15805 [>.............................] - ETA: 6s 1072/15805 [=>............................] - ETA: 6s 1180/15805 [=>............................] - ETA: 6s 1289/15805 [=>............................] - ETA: 6s 1397/15805 [=>............................] - ETA: 6s 1505/15805 [=>............................] - ETA: 6s 1612/15805 [==>...........................] - ETA: 6s 1720/15805 [==>...........................] - ETA: 6s 1824/15805 [==>...........................] - ETA: 6s 1932/15805 [==>...........................] - ETA: 6s 2040/15805 [==>...........................] - ETA: 6s 2147/15805 [===>..........................] - ETA: 6s 2256/15805 [===>..........................] - ETA: 6s 2365/15805 [===>..........................] - ETA: 6s 2474/15805 [===>..........................] - ETA: 6s 2583/15805 [===>..........................] - ETA: 6s 2690/15805 [====>.........................] - ETA: 6s 2794/15805 [====>.........................] - ETA: 6s 2899/15805 [====>.........................] - ETA: 6s 3006/15805 [====>.........................] - ETA: 5s 3113/15805 [====>.........................] - ETA: 5s 3220/15805 [=====>........................] - ETA: 5s 3327/15805 [=====>........................] - ETA: 5s 3435/15805 [=====>........................] - ETA: 5s 3542/15805 [=====>........................] - ETA: 5s 3650/15805 [=====>........................] - ETA: 5s 3757/15805 [======>.......................] - ETA: 5s 3865/15805 [======>.......................] - ETA: 5s 3965/15805 [======>.......................] - ETA: 5s 4071/15805 [======>.......................] - ETA: 5s 4179/15805 [======>.......................] - ETA: 5s 4286/15805 [=======>......................] - ETA: 5s 4394/15805 [=======>......................] - ETA: 5s 4503/15805 [=======>......................] - ETA: 5s 4612/15805 [=======>......................] - ETA: 5s 4720/15805 [=======>......................] - ETA: 5s 4828/15805 [========>.....................] - ETA: 5s 4936/15805 [========>.....................] - ETA: 5s 5043/15805 [========>.....................] - ETA: 5s 5151/15805 [========>.....................] - ETA: 4s 5259/15805 [========>.....................] - ETA: 4s 5368/15805 [=========>....................] - ETA: 4s 5476/15805 [=========>....................] - ETA: 4s 5584/15805 [=========>....................] - ETA: 4s 5691/15805 [=========>....................] - ETA: 4s 5798/15805 [==========>...................] - ETA: 4s 5903/15805 [==========>...................] - ETA: 4s 6009/15805 [==========>...................] - ETA: 4s 6114/15805 [==========>...................] - ETA: 4s 6221/15805 [==========>...................] - ETA: 4s 6330/15805 [===========>..................] - ETA: 4s 6439/15805 [===========>..................] - ETA: 4s 6547/15805 [===========>..................] - ETA: 4s 6656/15805 [===========>..................] - ETA: 4s 6763/15805 [===========>..................] - ETA: 4s 6871/15805 [============>.................] - ETA: 4s 6978/15805 [============>.................] - ETA: 4s 7086/15805 [============>.................] - ETA: 4s 7194/15805 [============>.................] - ETA: 4s 7302/15805 [============>.................] - ETA: 3s 7411/15805 [=============>................] - ETA: 3s 7421/15805 [=============>................] - ETA: 3s 7525/15805 [=============>................] - ETA: 3s 7633/15805 [=============>................] - ETA: 3s 7740/15805 [=============>................] - ETA: 3s 7849/15805 [=============>................] - ETA: 3s 7955/15805 [==============>...............] - ETA: 3s 8060/15805 [==============>...............] - ETA: 3s 8161/15805 [==============>...............] - ETA: 3s 8268/15805 [==============>...............] - ETA: 3s 8375/15805 [==============>...............] - ETA: 3s 8482/15805 [===============>..............] - ETA: 3s 8591/15805 [===============>..............] - ETA: 3s 8698/15805 [===============>..............] - ETA: 3s 8806/15805 [===============>..............] - ETA: 3s 8914/15805 [===============>..............] - ETA: 3s 9020/15805 [================>.............] - ETA: 3s 9126/15805 [================>.............] - ETA: 3s 9233/15805 [================>.............] - ETA: 3s 9341/15805 [================>.............] - ETA: 3s 9449/15805 [================>.............] - ETA: 3s 9556/15805 [=================>............] - ETA: 2s 9663/15805 [=================>............] - ETA: 2s 9771/15805 [=================>............] - ETA: 2s 9879/15805 [=================>............] - ETA: 2s 9988/15805 [=================>............] - ETA: 2s10096/15805 [==================>...........] - ETA: 2s10204/15805 [==================>...........] - ETA: 2s10313/15805 [==================>...........] - ETA: 2s10422/15805 [==================>...........] - ETA: 2s10530/15805 [==================>...........] - ETA: 2s10638/15805 [===================>..........] - ETA: 2s10746/15805 [===================>..........] - ETA: 2s10854/15805 [===================>..........] - ETA: 2s10963/15805 [===================>..........] - ETA: 2s11071/15805 [====================>.........] - ETA: 2s11179/15805 [====================>.........] - ETA: 2s11284/15805 [====================>.........] - ETA: 2s11392/15805 [====================>.........] - ETA: 2s11500/15805 [====================>.........] - ETA: 2s11609/15805 [=====================>........] - ETA: 1s11717/15805 [=====================>........] - ETA: 1s11826/15805 [=====================>........] - ETA: 1s11934/15805 [=====================>........] - ETA: 1s12042/15805 [=====================>........] - ETA: 1s12150/15805 [======================>.......] - ETA: 1s12259/15805 [======================>.......] - ETA: 1s12364/15805 [======================>.......] - ETA: 1s12470/15805 [======================>.......] - ETA: 1s12578/15805 [======================>.......] - ETA: 1s12686/15805 [=======================>......] - ETA: 1s12794/15805 [=======================>......] - ETA: 1s12901/15805 [=======================>......] - ETA: 1s13009/15805 [=======================>......] - ETA: 1s13118/15805 [=======================>......] - ETA: 1s13225/15805 [========================>.....] - ETA: 1s13331/15805 [========================>.....] - ETA: 1s13435/15805 [========================>.....] - ETA: 1s13541/15805 [========================>.....] - ETA: 1s13649/15805 [========================>.....] - ETA: 1s13757/15805 [=========================>....] - ETA: 0s13865/15805 [=========================>....] - ETA: 0s13973/15805 [=========================>....] - ETA: 0s14081/15805 [=========================>....] - ETA: 0s14190/15805 [=========================>....] - ETA: 0s14299/15805 [==========================>...] - ETA: 0s14408/15805 [==========================>...] - ETA: 0s14517/15805 [==========================>...] - ETA: 0s14626/15805 [==========================>...] - ETA: 0s14734/15805 [==========================>...] - ETA: 0s14843/15805 [===========================>..] - ETA: 0s14952/15805 [===========================>..] - ETA: 0s15061/15805 [===========================>..] - ETA: 0s15171/15805 [===========================>..] - ETA: 0s15281/15805 [============================>.] - ETA: 0s15389/15805 [============================>.] - ETA: 0s15496/15805 [============================>.] - ETA: 0s15603/15805 [============================>.] - ETA: 0s15712/15805 [============================>.] - ETA: 0s15805/15805 [==============================] - 8s 470us/step



Finish evaluation in 9.487627983093262s.

size of value_emul:  505750
Length of pos_X   :  505750
Num of vertex     :  505750
---------------------------------
